{
  "government_contracts": [
    {
      "contract_title": "Applied Technology Inc. - NAVY - Applied Technology Inc.,* King George, Virginia (N0017325D2419-N0017325F2415); Cutlass Systems Engin...",
      "contract_value": "$243,909,635",
      "contract_date": "2025-03-17",
      "text": "Applied Technology Inc.,* King George, Virginia (N0017325D2419-N0017325F2415); Cutlass Systems Engineering LLC,* Laurel, Maryland (N0017325D2420-N0017325F2416); Envisioneering Inc.,* Alexandria, Virginia (N0017325D2421-N0017325F2417); Future Technologies Inc.,* King George, Virginia (N0017325D2422-N0017325F2418); Intecon LLC,* Fredericksburg, Virginia (N0017325D2423- N0017325F2419); ISYS Inc.,* Littleton, Colorado (N0017325D2424-N0017325F2420); Remcom Inc.,* State College, Pennsylvania (N0017325D2425-N0017325F2421); and Technology Service Corp.,* Arlington, Virginia (N0017325D2426-N0017325F2422), are being awarded a $243,909,635 maximum ceiling across all vendors, indenite-delivery/indenite-quantity, multiple-award contract for tactical combat and electronic warfare systems research and development. These contracts do not include options and have a shared maximum ceiling of $243,909,635. Eight rm- xed-price $2,500 task orders were issued concurrently. The task orders do not have options and have individual cumulative values of $2,500. Work will be performed at the U.S. Naval Research Laboratory, Washington, D.C. (NRL), and is expected to be completed by March 2032. Fiscal 2025 working capital funds (defense) in the amount of $20,000 ($2,500 per awardee) will be obligated at time of award and will not expire at the end of the current scal year. This contract was competitively procured with nine offers received via Contract Opportunities on SAM.gov. U.S. NRL, Washington, D.C., is the contracting activity.",
      "agency": "NAVY",
      "contractor": "Applied Technology Inc.",
      "location": "* King George"
    },
    {
      "contract_title": "Lockheed Martin Rotary and Mission Systems - NAVY - Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $35,382,479 cost-p...",
      "contract_value": "$35,382,479",
      "contract_date": "2025-03-17",
      "text": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $35,382,479 cost-plus-award-fee modication to previously awarded contract N00024-23- C-5117 to exercise option items supporting Systems Engineering and Software Integration (SE/SI) for the Integrated Combat System across the surface force portfolio of the Navy and Coast Guard. Work will be performed in Moorestown, New Jersey (41%); Columbia, Maryland (30%); Norfolk, Virginia (7%); Middletown, Rhode Island (6%); College Park, Maryland (5%); Mount Laurel, New Jersey (4%), Huntsville, Alabama (3%), Wallops Island, Virginia (1%); Arlington, Virginia (1%); San Diego, California (1%); and Herndon, Virginia (1%), and is expected to be completed by September 2025. Fiscal 2025 research, development, test and evaluation (Navy) funds in the amount of $6,840,507 will be obligated at time of award and will not expire at the end of the current scal year. Naval Sea Systems Command, Washington, D.C. is the contracting activity (N00024-23-C-5117). (Awarded March 14, 2025)",
      "agency": "NAVY",
      "contractor": "Lockheed Martin Rotary and Mission Systems",
      "location": "Moorestown"
    },
    {
      "contract_title": "Saab Inc. - NAVY - Saab Inc., East Syracuse, New York, was awarded an $8,097,844 rm-xed-price modication to previously ...",
      "contract_value": "$8,097,844",
      "contract_date": "2025-03-17",
      "text": "Saab Inc., East Syracuse, New York, was awarded an $8,097,844 rm-xed-price modication to previously awarded contract N00024-21-C-5414 to exercise options for scal 2025 MK 9 production efforts. Work will be performed in East Syracuse, New York (81%), Rancho Cordova, California (13%); Airmont, New York (3%); Mountain View, California (2%); and Ronkonkoma, New York (1%), and is expected to be completed by March 2027. Fiscal 2025 shipbuilding and conversion (Navy) funds in the amount of $8,097,844 were obligated at the time of award and will not expire at the end of the current scal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded March 14, 2025)",
      "agency": "NAVY",
      "contractor": "Saab Inc.",
      "location": "East Syracuse"
    },
    {
      "contract_title": "Lockheed Martin Corp. - ARMY - Lockheed Martin Corp., Liverpool, New York, was awarded a $213,001,070 modication (P00063) to contra...",
      "contract_value": "$213,001,070",
      "contract_date": "2025-03-17",
      "text": "Lockheed Martin Corp., Liverpool, New York, was awarded a $213,001,070 modication (P00063) to contract W31P4Q-19-C-0058 for Sentinel radar systems and spares growth kits. Work will be performed in Liverpool, New York, with an estimated completion date of Sept. 13, 2027. Fiscal 2024 other procurement, Army funds in the amount of $213,001,070 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.",
      "agency": "ARMY",
      "contractor": "Lockheed Martin Corp.",
      "location": "Liverpool"
    },
    {
      "contract_title": "Airborne Systems North America – CA Inc. - ARMY - Airborne Systems North America – CA Inc., Santa Ana, California, was awarded an $11,376,079 rm-xed-p...",
      "contract_value": "$11,376,079",
      "contract_date": "2025-03-17",
      "text": "Airborne Systems North America – CA Inc., Santa Ana, California, was awarded an $11,376,079 rm-xed-price contract for the production of T-11 parachutes. Bids were solicited via the internet with two received. Work will be performed in Santa Ana, California, with an estimated completion date of May 29, 2026. Fiscal 2025 other procurement, Army funds in the amount of $11,376,079 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W911QY-25-F-A015).",
      "agency": "ARMY",
      "contractor": "Airborne Systems North America – CA Inc.",
      "location": "Santa Ana"
    },
    {
      "contract_title": "Weston Solutions Inc. - ARMY - Weston Solutions Inc., Albuquerque, New Mexico, was awarded a $9,427,254 modication (P00003) to cont...",
      "contract_value": "$9,427,254",
      "contract_date": "2025-03-17",
      "text": "Weston Solutions Inc., Albuquerque, New Mexico, was awarded a $9,427,254 modication (P00003) to contract W912DY-24-F-0020 for maintenance and repair services for petroleum facilities. Work will be performed in Fort Campbell, Kentucky; Grand Ledge, Michigan; Shelbyville, Indiana; Springeld, Illinois; North Canton, Ohio; Alpena, Michigan; Tullahoma, Tennessee; Blue Ash, Ohio; Richmond, Kentucky; Edinburgh, Indiana; Grayling, Michigan; Port Clinton, Ohio; Whitehall, Ohio; Wright-Patterson Air Force Base, Ohio; Augusta, Michigan; Fort Knox, Kentucky; Fort Wayne, Indiana; Peoria, Illinois; Bunker Hill, Indiana; Louisville, Kentucky; Louisville, Tennessee; Memphis, Tennessee; Nashville, Tennessee; Ravenna, Ohio; Columbus, Ohio; Rock Island, Illinois; Scott AFB, Illinois; Mount Clemens, Michigan; Manseld, Ohio; Springeld, Ohio; Swanton, Ohio; Greenville, Kentucky; Battle Creek, Michigan; and Vienna, Ohio, with an estimated completion date of April 7, 2026. Fiscal 2024 revolving funds in the amount of $9,427,254 were obligated at the time of the award. U.S. Army Corps of Engineers, Huntsville, Alabama, is the contracting activity.",
      "agency": "ARMY",
      "contractor": "Weston Solutions Inc.",
      "location": "Albuquerque"
    },
    {
      "contract_title": "InDyne Inc. - AIR FORCE - InDyne Inc., Lexington Park, Maryland, has been awarded an $89,902,563 modication (P00059) to a prev...",
      "contract_value": "$89,902,563",
      "contract_date": "2025-03-17",
      "text": "InDyne Inc., Lexington Park, Maryland, has been awarded an $89,902,563 modication (P00059) to a previously awarded contract (FA2518-22-C-0001) for Solid State Phased Array Radar Systems and Long-Range Discrimination Radar support, exercising Option Year 7. This modication brings the total cumulative face value of the contract to $384,723,485 from $294,820,922. Work will be performed at Beale Air Force Base, California; Cape Cod Space Force Station, Massachusetts; Clear SFS, Anderson, Alaska; Pitufk Space Base, Greenland; Cheyenne Mountain SFS, Colorado; and Royal Air Force Fylingdales, United Kingdom, and is expected to be complete by April 30, 2026. Fiscal 2025 operation and maintenance funds in the amount of $89,634,609; and scal 2025 and 2026 research and development funds in the amount of $340,038, are being obligated at the time of award. The Space Operations Command, Space Acquisition and Integration Ofce, Peterson SFB, Colorado, is the contracting activity.",
      "agency": "AIR FORCE",
      "contractor": "InDyne Inc.",
      "location": "Lexington Park"
    },
    {
      "contract_title": "LinQuest Corp. - AIR FORCE - LinQuest Corp., Herndon, Virginia, has been awarded a $36,085,193 cost-plus-incentive- fee modicatio...",
      "contract_value": "$36,085,193",
      "contract_date": "2025-03-17",
      "text": "LinQuest Corp., Herndon, Virginia, has been awarded a $36,085,193 cost-plus-incentive- fee modication (P00108) to a previously awarded contract (FA8808-19-C-0006) for additional systems engineering, integration, and test support. The modication brings the total cumulative face value of the contract to $799,951,039. Work will be performed in El Segundo, California, and is expected to be completed by Feb. 26, 2026. Fiscal 2025 operation and maintenance funds in the amount of $2,712,725; and scal 2025 procurement funds in the amount of $883,352, are being obligated at the time of award. The Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity. (Awarded March 14, 2025)",
      "agency": "AIR FORCE",
      "contractor": "LinQuest Corp.",
      "location": "Herndon"
    },
    {
      "contract_title": "DCS Corp. - AIR FORCE - DCS Corp., Alexandria, Virginia, has been awarded a $22,107,341 modication (P00019) to previously aw...",
      "contract_value": "$22,107,341",
      "contract_date": "2025-03-17",
      "text": "DCS Corp., Alexandria, Virginia, has been awarded a $22,107,341 modication (P00019) to previously awarded (FA8650-22-F-2611) for teaming of humans and unmanned networked drone research. The modication brings the total cumulative face value of the contract to $30,344,598 from $8,237,257. Work will be performed at Wright Patterson Air Force Base, Ohio, and is expected to be completed by May 12, 2028. Fiscal 2025 research and development funds in the amount of $375,000 are being obligated at time of award. The Air Force Research Laboratory Aerospace Systems Directorate, Wright Patterson AFB, Ohio, is the contracting activity.",
      "agency": "AIR FORCE",
      "contractor": "DCS Corp.",
      "location": "Alexandria"
    },
    {
      "contract_title": "Improve Group Inc. - AIR FORCE - Improve Group Inc.,* Albuquerque, New Mexico, was awarded a $10,333,859 stand-alone, rm-xed-price co...",
      "contract_value": "$10,333,859",
      "contract_date": "2025-03-17",
      "text": "Improve Group Inc.,* Albuquerque, New Mexico, was awarded a $10,333,859 stand-alone, rm-xed-price contract for a modular vivarium laboratory. Work will be performed at Joint Base San Antonio, Texas, and is expected to be completed by Sept. 1, 2026. This contract was a sole source acquisition. Fiscal 2024 research, development, test and evaluation funds in the amount of $5,692,238; and scal 2025 research, development, test and evaluation funds in the amount of $4,641,621, are being obligated at time of award. The 502d Contracting Squadron, JBSA, Texas, is the contracting activity (FA3016-25-C-0009). (Awarded March 4, 2025)",
      "agency": "AIR FORCE",
      "contractor": "Improve Group Inc.",
      "location": "* Albuquerque"
    },
    {
      "contract_title": "CORRECTION: The $13 - AIR FORCE - CORRECTION: The $13,081,102 contract (FA8637-25-C-B002) awarded to Sierra Nevada Corp., Fort Walton ...",
      "contract_value": "$13,081,102",
      "contract_date": "2025-03-17",
      "text": "CORRECTION: The $13,081,102 contract (FA8637-25-C-B002) awarded to Sierra Nevada Corp., Fort Walton Beach, Florida, on March 4, 2025, was announced with an incorrect award date. The correct award date is March 13, 2025.",
      "agency": "AIR FORCE",
      "contractor": "CORRECTION: The $13",
      "location": "081"
    },
    {
      "contract_title": "Breeze-Eastern Corp. - DEFENSE LOGISTICS AGENCY - Breeze-Eastern Corp., Whippany, New Jersey, has been awarded an estimated $63,106,371 rm-xed-price, ...",
      "contract_value": "$63,106,371",
      "contract_date": "2025-03-17",
      "text": "Breeze-Eastern Corp., Whippany, New Jersey, has been awarded an estimated $63,106,371 rm-xed-price, indenite-delivery requirements contract for aircraft mount winches. This was a limited competitive acquisition with one response received. This is a ve-year contract with no option periods. The performance completion date is March 31, 2030. Using military service is Army. The type of appropriation is scal 2025 Army working capital funds. The contracting activity is the Defense Logistics Agency Aviation, Redstone Arsenal, Alabama (SPRRA1-25-D-0009).",
      "agency": "DEFENSE LOGISTICS AGENCY",
      "contractor": "Breeze-Eastern Corp.",
      "location": "Whippany"
    },
    {
      "contract_title": "Golden State Medical Supply Inc. - DEFENSE LOGISTICS AGENCY - Golden State Medical Supply Inc.,* Camarillo, California, has been awarded an estimated $19,672,083 ...",
      "contract_value": "$19,672,083",
      "contract_date": "2025-03-17",
      "text": "Golden State Medical Supply Inc.,* Camarillo, California, has been awarded an estimated $19,672,083 modication (P00007) exercising the third one-year option period of a one- year base contract (SPE2D2-22-D-0142) with four one-year option periods for febuxostat tablets. This is a xed-price, requirements contract. Location of performance is Ohio, with an April 6, 2026, performance completion date. Using customers are Army, Navy, Air Force, Marine Corps, Coast Guard, Department of Veterans Affairs, Indian Health Services, and Federal Bureau of Prisons. Type of appropriation is scal 2025 through 2026 defense working capital funds. The contracting agency is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania.",
      "agency": "DEFENSE LOGISTICS AGENCY",
      "contractor": "Golden State Medical Supply Inc.",
      "location": "* Camarillo"
    },
    {
      "contract_title": "OptumHealth Care Solutions LLC - DEFENSE HEALTH AGENCY - OptumHealth Care Solutions LLC, Eden Prairie, Minnesota, is awarded a $24,587,905 option modication ...",
      "contract_value": "$24,587,905",
      "contract_date": "2025-03-17",
      "text": "OptumHealth Care Solutions LLC, Eden Prairie, Minnesota, is awarded a $24,587,905 option modication to extend services on the Military Health System Global Nurse Advice Line bridge contract (HT001124C0011). The GNAL is a service to Military Health System eligible beneciaries and provides access to telehealth registered nurses for triage services, self-care advice, and general health inquiries 24 hours a day, 7 days a week. This modication is being issued subject to the availability of scal year 2025 operation and maintenance appropriations through Sept. 17, 2025. The place of performance is Falls Church, Virginia. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. (Awarded March 14, 2025)",
      "agency": "DEFENSE HEALTH AGENCY",
      "contractor": "OptumHealth Care Solutions LLC",
      "location": "Eden Prairie"
    },
    {
      "contract_title": "Lawelawe Technology Services LLC - DEFENSE HEALTH AGENCY - Lawelawe Technology Services LLC, Kailua, Hawaii, is awarded option period three of a rm- xed price ...",
      "contract_value": "$10,386,669",
      "contract_date": "2025-03-17",
      "text": "Lawelawe Technology Services LLC, Kailua, Hawaii, is awarded option period three of a rm- xed price contract (HT001122C0019) to provide information technology and telecommunication services and provide professional administrative management in support of the Defense Health Agency Joint Operational Medicine Information System program. Work will be primarily performed at Fort Sam Houston, Texas. The total award amount of this option exercise modication is $10,386,669. Operation and maintenance funds in the amount of $10,386,669 will be obligated for scal 2025. The total contract value is $46,498,983. The contract was a direct award through the Small Business Administration 8(a) program in accordance with 15 U.S. Code 637 as implemented by Federal Acquisition Regulation 6.302-5(b)(4) and was executed on July 21, 2022. The period of performance for this option period exercise is March 9, 2025, to March 8, 2026. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. (Awarded March 6, 2025)",
      "agency": "DEFENSE HEALTH AGENCY",
      "contractor": "Lawelawe Technology Services LLC",
      "location": "Kailua"
    },
    {
      "contract_title": "U.S. TRANSPORTATION COMMAND\nUPDATE: Avelo Airlines Inc. - DEFENSE HEALTH AGENCY - U.S. TRANSPORTATION COMMAND UPDATE: Avelo Airlines Inc., Houston, Texas (HTC71125DCC35), has been ad...",
      "contract_value": "N/A",
      "contract_date": "2025-03-17",
      "text": "U.S. TRANSPORTATION COMMAND UPDATE: Avelo Airlines Inc., Houston, Texas (HTC71125DCC35), has been added as the 31st awardee to the indenite-delivery/indenite-quantity, xed price with economic-price- adjustments, multiple award contract for international long-range and short-range charter airlift services under the International Charter Airlift Services in Support of the Civil Reserve Air Fleet contract awarded on Oct. 1, 2024. The U.S. Transportation Command, Directorate of Acquisition, Scott Air Force Base, Illinois, is the contracting activity.",
      "agency": "DEFENSE HEALTH AGENCY",
      "contractor": "U.S. TRANSPORTATION COMMAND\nUPDATE: Avelo Airlines Inc.",
      "location": "Houston"
    },
    {
      "contract_title": "CORRECTION: The $13 - DEFENSE COUNTERINTELLIGENCE AND SECURITY AGENCY - CORRECTION: The $13,347,865 contract (HS002125CE005) announced on March 14, 2025, for DNI Emerging T...",
      "contract_value": "$13,347,865",
      "contract_date": "2025-03-17",
      "text": "CORRECTION: The $13,347,865 contract (HS002125CE005) announced on March 14, 2025, for DNI Emerging Technologies, Oklahoma City, Oklahoma, was announced with the wrong award date. The correct award date is March 17, 2025.",
      "agency": "DEFENSE COUNTERINTELLIGENCE AND SECURITY AGENCY",
      "contractor": "CORRECTION: The $13",
      "location": "347"
    }
  ],
  "news_feed": [
    {
      "headline": "NAVY awards $243,909,635 contract to Applied Technology Inc.",
      "publication_date": "2025-03-17",
      "summary": "Applied Technology Inc.,* King George, Virginia (N0017325D2419-N0017325F2415); Cutlass Systems Engineering LLC,* Laurel, Maryland (N0017325D2420-N0017325F2416); Envisioneering Inc.,* Alexandria, Virginia (N0017325D2421-N0017325F2417); Future Technologies Inc.,* King George, Virginia (N0017325D2422-N..."
    },
    {
      "headline": "NAVY awards $35,382,479 contract to Lockheed Martin Rotary and Mission Systems",
      "publication_date": "2025-03-17",
      "summary": "Lockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $35,382,479 cost-plus-award-fee modication to previously awarded contract N00024-23- C-5117 to exercise option items supporting Systems Engineering and Software Integration (SE/SI) for the Integrated Combat System acro..."
    },
    {
      "headline": "NAVY awards $8,097,844 contract to Saab Inc.",
      "publication_date": "2025-03-17",
      "summary": "Saab Inc., East Syracuse, New York, was awarded an $8,097,844 rm-xed-price modication to previously awarded contract N00024-21-C-5414 to exercise options for scal 2025 MK 9 production efforts. Work will be performed in East Syracuse, New York (81%), Rancho Cordova, California (13%); Airmont, New Yor..."
    },
    {
      "headline": "ARMY awards $213,001,070 contract to Lockheed Martin Corp.",
      "publication_date": "2025-03-17",
      "summary": "Lockheed Martin Corp., Liverpool, New York, was awarded a $213,001,070 modication (P00063) to contract W31P4Q-19-C-0058 for Sentinel radar systems and spares growth kits. Work will be performed in Liverpool, New York, with an estimated completion date of Sept. 13, 2027. Fiscal 2024 other procurement..."
    },
    {
      "headline": "ARMY awards $11,376,079 contract to Airborne Systems North America – CA Inc.",
      "publication_date": "2025-03-17",
      "summary": "Airborne Systems North America – CA Inc., Santa Ana, California, was awarded an $11,376,079 rm-xed-price contract for the production of T-11 parachutes. Bids were solicited via the internet with two received. Work will be performed in Santa Ana, California, with an estimated completion date of May 2..."
    },
    {
      "headline": "ARMY awards $9,427,254 contract to Weston Solutions Inc.",
      "publication_date": "2025-03-17",
      "summary": "Weston Solutions Inc., Albuquerque, New Mexico, was awarded a $9,427,254 modication (P00003) to contract W912DY-24-F-0020 for maintenance and repair services for petroleum facilities. Work will be performed in Fort Campbell, Kentucky; Grand Ledge, Michigan; Shelbyville, Indiana; Springeld, Illinois;..."
    },
    {
      "headline": "AIR FORCE awards $89,902,563 contract to InDyne Inc.",
      "publication_date": "2025-03-17",
      "summary": "InDyne Inc., Lexington Park, Maryland, has been awarded an $89,902,563 modication (P00059) to a previously awarded contract (FA2518-22-C-0001) for Solid State Phased Array Radar Systems and Long-Range Discrimination Radar support, exercising Option Year 7. This modication brings the total cumulative..."
    },
    {
      "headline": "AIR FORCE awards $36,085,193 contract to LinQuest Corp.",
      "publication_date": "2025-03-17",
      "summary": "LinQuest Corp., Herndon, Virginia, has been awarded a $36,085,193 cost-plus-incentive- fee modication (P00108) to a previously awarded contract (FA8808-19-C-0006) for additional systems engineering, integration, and test support. The modication brings the total cumulative face value of the contract ..."
    },
    {
      "headline": "AIR FORCE awards $22,107,341 contract to DCS Corp.",
      "publication_date": "2025-03-17",
      "summary": "DCS Corp., Alexandria, Virginia, has been awarded a $22,107,341 modication (P00019) to previously awarded (FA8650-22-F-2611) for teaming of humans and unmanned networked drone research. The modication brings the total cumulative face value of the contract to $30,344,598 from $8,237,257. Work will be..."
    },
    {
      "headline": "AIR FORCE awards $10,333,859 contract to Improve Group Inc.",
      "publication_date": "2025-03-17",
      "summary": "Improve Group Inc.,* Albuquerque, New Mexico, was awarded a $10,333,859 stand-alone, rm-xed-price contract for a modular vivarium laboratory. Work will be performed at Joint Base San Antonio, Texas, and is expected to be completed by Sept. 1, 2026. This contract was a sole source acquisition. Fiscal..."
    },
    {
      "headline": "AIR FORCE awards $13,081,102 contract to CORRECTION: The $13",
      "publication_date": "2025-03-17",
      "summary": "CORRECTION: The $13,081,102 contract (FA8637-25-C-B002) awarded to Sierra Nevada Corp., Fort Walton Beach, Florida, on March 4, 2025, was announced with an incorrect award date. The correct award date is March 13, 2025."
    },
    {
      "headline": "DEFENSE LOGISTICS AGENCY awards $63,106,371 contract to Breeze-Eastern Corp.",
      "publication_date": "2025-03-17",
      "summary": "Breeze-Eastern Corp., Whippany, New Jersey, has been awarded an estimated $63,106,371 rm-xed-price, indenite-delivery requirements contract for aircraft mount winches. This was a limited competitive acquisition with one response received. This is a ve-year contract with no option periods. The perfor..."
    },
    {
      "headline": "DEFENSE LOGISTICS AGENCY awards $19,672,083 contract to Golden State Medical Supply Inc.",
      "publication_date": "2025-03-17",
      "summary": "Golden State Medical Supply Inc.,* Camarillo, California, has been awarded an estimated $19,672,083 modication (P00007) exercising the third one-year option period of a one- year base contract (SPE2D2-22-D-0142) with four one-year option periods for febuxostat tablets. This is a xed-price, requireme..."
    },
    {
      "headline": "DEFENSE HEALTH AGENCY awards $24,587,905 contract to OptumHealth Care Solutions LLC",
      "publication_date": "2025-03-17",
      "summary": "OptumHealth Care Solutions LLC, Eden Prairie, Minnesota, is awarded a $24,587,905 option modication to extend services on the Military Health System Global Nurse Advice Line bridge contract (HT001124C0011). The GNAL is a service to Military Health System eligible beneciaries and provides access to t..."
    },
    {
      "headline": "DEFENSE HEALTH AGENCY awards $10,386,669 contract to Lawelawe Technology Services LLC",
      "publication_date": "2025-03-17",
      "summary": "Lawelawe Technology Services LLC, Kailua, Hawaii, is awarded option period three of a rm- xed price contract (HT001122C0019) to provide information technology and telecommunication services and provide professional administrative management in support of the Defense Health Agency Joint Operational M..."
    },
    {
      "headline": "DEFENSE HEALTH AGENCY awards N/A contract to U.S. TRANSPORTATION COMMAND\nUPDATE: Avelo Airlines Inc.",
      "publication_date": "2025-03-17",
      "summary": "U.S. TRANSPORTATION COMMAND UPDATE: Avelo Airlines Inc., Houston, Texas (HTC71125DCC35), has been added as the 31st awardee to the indenite-delivery/indenite-quantity, xed price with economic-price- adjustments, multiple award contract for international long-range and short-range charter airlift ser..."
    },
    {
      "headline": "DEFENSE COUNTERINTELLIGENCE AND SECURITY AGENCY awards $13,347,865 contract to CORRECTION: The $13",
      "publication_date": "2025-03-17",
      "summary": "CORRECTION: The $13,347,865 contract (HS002125CE005) announced on March 14, 2025, for DNI Emerging Technologies, Oklahoma City, Oklahoma, was announced with the wrong award date. The correct award date is March 17, 2025."
    }
  ]
}